Repository: 84000/data-translation-memory
Catalog: toh507-v3.tmx
Source language: bo
Languages: en

source: །གང་ཞིག་སངས་རྒྱས་ཀྱི་གཟུགས་བརྙན་ནམ། མཆོད་རྟེན་ཐམས་ཅད་ཀྱི་ནང་དུ་འཇོག་པར་བྱེད་ན་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན་དུ་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: If someone places it within a buddha image or inside a stūpa, the image of the Thus-Gone One will be blessed with the nature of the seven precious materials.

source: །འཁོར་ལོའི་ཕྲེང་བ་དང་། དྲིལ་བུ་གཡེར་ཀའི་དྲ་བར་སྦྲེལ་བ་དང་བཅས་པ་དང་། བཀྲ་ཤིས་དང་། ཆར་ཀབ་ཀྱི་གཟུགས་དང་། དྲིལ་བུར་བཅས་པ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན་དུ་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: The stūpa’s circular rings, connected lattices of little bells, auspicious signs, rain gutters, and bells will be blessed with the nature of the seven precious materials.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མཐུ་དང་བྱིན་གྱིས་བརླབས་དང་། བདེན་པ་དང་། དམ་ཚིག་གིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: Such persons will be blessed by all the thus-gone ones and by the power, blessings, truth, and pledges of this doctrinal synopsis until they arrive at the seat of enlightenment. “

source: །སེམས་ཅན་གང་དག་མཆོད་རྟེན་དེ་ལ་ཕུ་དུད་དང་། བསྟི་སྟང་བྱེད་པ་དེ་དག་ངེས་པར་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Those sentient beings who revere and honor the stūpa will certainly not regress and they will be awakened to unsurpassed, completely perfect enlightenment.

source: །ཕྱག་འཚལ་བ་གཅིག་དང་། བསྐོར་བ་བྱེད་པ་གཅིག་གིས་མནར་མེད་པ་ཐུག་པ་ལ་སོགས་པ་རྣམས་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་ཞིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Those who prostrate to or circumambulate it once will be released from falling into the Avīci hell and they will no longer turn away from unsurpassed, completely perfect enlightenment.

source: །གནས་གང་ན་མཆོད་རྟེན་ནམ་གཟུགས་བརྙན་འདི་ལྟ་བུ་གནས་པའི་ས་ཕྱོགས་དེ་ཡང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: Areas where there are such stūpas or images will be blessed by all the thus-gone ones.

source: །ཕྱོགས་དེར་ཀླུ་མི་སྲུན་པས་ཀྱང་མི་ཚུགས་པར་འགྱུར། སད་དང་སེར་བས་ཀྱང་མི་ཚུགས་པར་འགྱུར།
en: Such areas will be unaffected by hostile nāgas, frost, and hail.

source: གནས་དེར་སྲོག་ཆགས་མི་སྲུན་པའམ་གདུག་པས་ཀྱང་མི་ཚུགས་པར་འགྱུར། གཅན་གཟན་གྱིས་ཀྱང་མི་ཚུགས་པར་འགྱུར། བྱ་མི་སྲུན་པ་དང་། ནེ་ཙོ་དང་། རི་སྐེགས་དང་། བྱི་བ་དང་། སྲེ་མོ་དང་། ཤ་སྦྲང་དང་། སྦྲང་བུ་དང་།
en: These places will be unaffected by hostile or malevolent creatures and unaffected by predators.

source: བྱེ་བ་དང་། སྦྲང་མ་མཆུ་གསུམ་པ་དང་། མཆུ་རིངས་དང་། རྟ་བླའི་འཇིགས་པའང་མི་འབྱུང་བར་འགྱུར། སྦྲུལ་གདུག་པས་ཀྱང་མི་ཚུགས་པར་འགྱུར་རོ།
en: There will be no fear of birds of prey, or of parrots, mynah birds, rats, mongooses, biting insects, bees, ladybugs, worms, mosquitoes, or centipedes.

source: །ཕྱོགས་དེར་ཡམས་ཀྱི་ནད་དང་། ནད་འགོ་བ་དང་། འཁྲུག་པའང་མི་འབྱུང་བར་འགྱུར། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་།
en: These areas will be unaffected by poisonous snakes, and there will be no epidemics, contagious diseases, or disturbances.

source: འབྱུང་པོ་དང་། ཡི་དགས་དང་། འདྲེ་དང་། བརྗེད་བྱེད་ཀྱི་འཇིགས་པ་ཡང་མི་འབྱུང་བར་འགྱུར།
en: There will be no fear of yakṣas, rākṣasas, bhūtas, pretas, piśācas, or apasmāras.

source: གདོན་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་ཚུགས་པར་འགྱུར།
en: These areas will be unaffected by any type of graha.

source: རིམས་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་ཚུགས་པར་འགྱུར། ནད་ཐམས་ཅད་དང་། འབྲས་དང་། ཕོལ་མིག་དང་། ལྷོག་པ་དང་།
en: They will be unaffected by fever.

source: མཚན་བར་རྡོལ་བ་དང་། རྐང་ཤུ་དང་། གཡན་པ་དང་། མཛེས་ཀྱང་མི་ཚུགས་པར་འགྱུར་ཞིང་མཆོད་རྟེན་དེ་མཐོང་བ་ཙམ་གྱིས་ཐམས་ཅད་འབྱང་བར་འགྱུར་རོ། །ཕྱོགས་དེར་བ་ལང་གི་ནད་དང་།
en: Their inhabitants will be unaffected by any illness—by boils, blisters, ulcers, fistulas, eczema, scabies, or leprosy—and by just seeing the stūpa, they will be cleansed of all these diseases.

source: ཕྱུགས་ནད་དང་། དུད་འགྲོའི་སྐྱེ་གནས་རྣམ་པ་མང་པོ་གཞན་དག་གི་ནད་དང་།
en: These areas will be unaffected by the diseases of cattle and herd animals, or by the many other kinds of illnesses that beset animals.

source: སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོའི་ནད་ཀྱིས་ཀྱང་ནམ་ཡང་ཚུགས་པར་མི་འགྱུར་རོ།
en: They will never be affected by the diseases of men, women, boys, or girls.

source: །དུས་མ་ཡིན་པར་འཆི་བས་ཀྱང་དུས་མ་ཡིན་པར་འཆི་བར་མི་འགྱུར། དུག་གིས་མ་ཡིན། མཚོན་གྱིས་མ་ཡིན་ཞིང་མེ་དང་། ཆུས་ཀྱང་ནམ་ཡང་མི་ཚུགས་པར་འགྱུར།
en: There will be no untimely death, and the people will never be affected by poison, weapons, fire, or water. “

source: ཕ་རོལ་གྱི་དམག་ཚོགས་ཀྱི་འཇིགས་པས་མ་ཡིན། ལོ་ཉེས་ཀྱི་འཇིགས་པས་ཀྱང་ནམ་ཡང་མི་ཚུགས་པར་འགྱུར།
en: There will be no fear of external armies, and the people will never be affected by the fear of bad harvests.

source: རྒྱལ་པོ་ཆེན་པོའི་དམག་གི་འཇིགས་པ་ཡང་མི་འབྱུང་བར་འགྱུར་རོ། །རྒྱལ་པོ་ཆེན་པོ་བཞིའང་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་ས་ཕྱོགས་དེར་སྲུང་བར་བྱེད། ཡོངས་སུ་སྐྱོང་བར་བྱེད་དོ།
en: There will be no fear of the royal army, and the Four Great Kings will continuously guard and protect these areas.

source: །གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་པོ་དེ་དག་ཀྱང་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་སྲུང་བ་དང་། སྐྱོབ་པ་དང་། སྦེད་པ་བྱེད་པར་འགྱུར་རོ།
en: The twenty-eight yakṣa commanders, too, will continuously guard, protect, and defend these areas.

source: །རྒྱུ་སྐར་ཉི་ཤུ་རྩ་བརྒྱད་དང་། ཟླ་བ་དང་། ཉི་མ་དང་། མཇུག་རིངས་ཆེན་པོའང་ཉིན་མཚན་མཐུན་པར་བྱེད་པར་འགྱུར་རོ།
en: The twenty-eight constellations, the moon, the sun, and the great comets will maintain harmony, day and night.

source: །ཀླུའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱང་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་མདངས་མི་འཕྲོག་ཅིང་ལེགས་པ་ཁོ་ནར་ཆར་གྱི་རྒྱུན་འབེབས་པར་འགྱུར་རོ།
en: All the nāga kings, moreover, will never steal vitality; they will only bring down a rainfall of excellence.

source: །ལྷ་ཐམས་ཅད་ཀྱང་མཆོད་རྟེན་ཆེན་པོ་དེ་ལ་ཕྱག་འཚལ་བ་དང་། བཀུར་སྟི་བྱ་བ་དང་། མཆོད་པ་བྱ་བའི་ཕྱིར་གནས་སུམ་ཅུ་རྩ་གཉིས་ནས་དུས་གསུམ་དུ་འོང་ངོ་།
en: Even the gods will come thrice a day from their thirty-two abodes in order to prostrate to, honor, and worship the great stūpa.

source: །ཡུལ་ན་གནས་པ་ཐམས་ཅད་ཀྱང་མཆོད་རྟེན་དང་། གཟུགས་བརྙན་དེའི་དྲུང་དུ་དུས་གསུམ་དུ་འོང་ངོ་། །སྟོད་པར་བྱེད། སྐོར་བ་བྱེད་པར་འགྱུར་རོ།
en: All the local deities will also come before those stūpas and images of the buddha thrice a day to praise and circumambulate them.

source: །ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ཀྱང་ལྷའི་བུ་མོ་དང་། ལྷའི་ཚོགས་རྣམས་དང་ལྷན་ཅིག་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་མཆོད་རྟེན་ནམ། གཟུགས་བརྙན་དེའི་དྲུང་དུ་ཉིན་མཚན་དུས་གསུམ་དུ་འོང་སྟེ། ཕྱག་འཚལ་བ་དང་། མཆོད་པ་ལ་འོང་ངོ་།
en: Even the sovereign of the gods, Śakra, along with the goddesses and gods themselves, will always come thrice a day and night before the stūpas or buddha images, and will prostrate to and worship them. “

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱང་རྟག་པར་དགོངས་པ་དང་། བྱིན་གྱི་རློབ་པར་འགྱུར་རོ། །མཆོད་རྟེན་དང་། གཟུགས་བརྙན་ཇི་ལྟ་ཇི་ལྟ་བུ་ལས་བྱེད་པའི་སའིའམ། རྡོའིའམ། ཤིང་གིའམ།
en: All the thus-gone ones will constantly consider and bless the stūpas.

source: དངུལ་གྱིའམ། གསེར་གྱིའམ། ཟངས་ཀྱིར་བྱེད་པ་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་བྲིས་ཏེ། དེའི་ནང་དུ་བཞག་ན་བཞག་མ་ཐག་ཙམ་གྱིས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན་དུ་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ། །འཕང་དང་། ཐེམ་སྐས་དང་། ཁ་རན་དང་། འཁོར་ལོའི་ཕྲེང་བ་དང་།
en: Whatever the stūpas and images are made of—whether of clay, stone, wood, silver, gold, or copper—as soon as this doctrinal synopsis has been written down and placed inside them, they will be blessed with the nature of the seven precious materials.

source: བཀྲ་ཤིས་དང་། གདུགས་དང་། དྲིལ་བུ་འཕྱང་བ་དང་། བ་དན་དང་། དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན་དུ་འགྱུར་རོ།
en: All their moldings, steps, railings, circular rings, auspicious signs, parasols, dangling bells, pennants, and lattices of little bells will likewise take on the nature of the seven precious materials.

source: །ཕྱོགས་བཞི་ཀུན་ན་ཡང་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་གནས་པར་འགྱུར་རོ།
en: Everywhere in the four directions there will be images of the Thus-Gone One.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་མཆོད་རྟེན་རིན་པོ་ཆེ་དང་། སྐུ་གདུང་གི་སྙིང་པོའི་མཆོད་རྟེན་དང་། མཆོད་གནས་སུ་འགྱུར་རོ།
en: There will be precious stūpas blessed by all the thus-gone ones, stūpas of the quintessence of their bodily remains, and places of worship.

source: །སྐུ་གཟུགས་དང་། མཆོད་རྟེན་དེ་འོག་མིན་གྱི་གནས་ཀྱི་ལྷས་ཀྱང་ཡོངས་སུ་བསྐྱང་བ་དང་། མཆོད་པས་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ།
en: The images and stūpas will be protected by the gods of Akaniṣṭha, who will be committed to their worship.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡོན་ཏན་གྱི་ཁྱད་པར་འདི་ལྟ་བུར་འགྱུར།
en: The great yakṣa commander, Vajrapāṇi, then asked the Blessed One, “How, O Blessed One, did this doctrinal synopsis come to have such distinctive qualities?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་ཀྱིས་སྙིང་པོ་གསང་བ་རིང་བསྲེལ་གྱི་ཟ་མ་ཏོག་གི་ཕྱག་རྒྱའི་གཟུངས་ཡིན་ཏེ།
en: The Blessed One replied, “The quintessence of the blessings of all the thus-gone ones is this dhāraṇī that is the seal of the receptacle of secret relics.

source: ལག་ན་རྡོ་རྗེ་དེས་ན་མཐུ་འདི་ནི་ཡོན་ཏན་གྱི་ཁྱད་པར་འདི་ལྟ་བུར་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་ཡིན་ནོ། །རྡོ་རྗེ་འཛིན་གྱིས་གསོལ་པ།
en: It is, therefore, O Vajrapāṇi, this power that instills it with blessings of such distinctive qualities.” “

source: བཅོམ་ལྡན་འདས་རིན་པོ་ཆེའི་ཟ་མ་ཏོག་གི་ཕྱག་རྒྱའི་གཟུངས་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་བཤད་པར་ཅི་གནང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Would the Blessed One please teach the doctrinal synopsis of the dhāraṇī that is the seal of the precious receptacle?”

source: ལག་ན་རྡོ་རྗེ་ཉོན་ཅིག་དེ་བཞིན་གཤེགས་པ་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བ་དང་། གང་དག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་གསུམ་སྟེ། ཆོས་ཀྱི་སྐུ་དང་། ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་དང་། དེ་བཞིན་དུ་སྤྲུལ་པའི་སྐུ་སྟེ། དུས་གསུམ་པ་ཐམས་ཅད་ཀྱི་རིང་བསྲེལ་གྱི་ཟ་མ་ཏོག་གི་ཕྱག་རྒྱའི་གཟུངས་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡིན་ནོ། །ན་མ་སྟྲཻ་ཡ་དྷཱི་ཀཱ་ནཱཾ། སརྦྦ་ཏ་ཐཱ་ག་ཏཱ་ནཱཾ།
en: asked the vajra holder. “

source: ཨོཾ་བྷུ་བི་བྷ་བཱན་བ་རེ་བ་ཙ་ཊཽ། ཙུ་ལུ་ཙུ་ལུ། དྷ་ར་དྷ་ར། སརྦྦ་ཏ་ཐཱ་ག་ཏཱ། དྷཱ་ཏུ་དྷ་རེ། པདྨ་གརྦྷེ།
en: Listen, Vajrapāṇi!”

source: ཛ་ཡ་བ་རེ། ཨ་ཙ་ལེ། སྨ་ར་ཏ་ཐཱ་ག་ཏ། དྷརྨྨ་ཙཀྲ། པྲ་བརྟ་ན། བཛྲ་བོ་དྷི་མཎྜ་ཨ་ལཾ་ཀཱ་ར། ཨ་ལཾ་ཀྲྀ་ཏེ། སརྦྦ་ཏ་ཐཱ་ག་ཏ། ཨ་དྷིཥྛི་ཏེ། བོ་དྷ་ཡ་བོ་དྷ་ཡ། བོ་དྷ་ནི་བོ་དྷ་ནི། བུདྷྱ་བུདྡྷྱ། སྃ་བོ་དྷ་ནི་སྃ་བོ་དྷ་ཡ། ཙ་ལ་ཙ་ལ། ཙ་ལནྟུ་སརྦྦ་ཨཱ་བ་ར་ཎཱ་ནི། སརྦ་པཱ་པྃ་བི་ག་ཏེ། ཧུ་རུ་ཧུ་རུ། སརྦྦ་ཤོ་ཀ་བི་ག་ཏེ། སརྦ་ཏ་ཐཱ་ག་ཏ་ཧྲྀ་ད་ཡ། བཛྲི་ཎི། སམྦྷ་བ་སམྦྷ་བ། སརྦ་ཏ་ཐཱ་ག་ཏ་གུ་ཧྱེ། ངྷཱ་ར་ཎི་མུ་དྲེ། བུད་དྷེ། །སུ་བུད་དྷེ། སརྦ་ཏ་ཐཱ་ག་ཏ་ཨ་དྷིཥྛི་ཏེ། དྷཱ་ཏུ་གརྦྷེ་སྭཱ་ཧཱ། ས་མ་ཡ་ཨ་དྷིཥྛི་ཏེ་སྭཱ་ཧཱ། སརྦ་ཏ་ཐཱ་ག་ཏ་ཧྲྀ་ད་ཡ། དྷཱ་ཏུ་མུ་དྲེ་སྭཱ་ཧཱ། སུ་པྲ་ཏིཥྛི་ཏ་སྟཱུཔེ་ཏ་ཐཱ་ག་ཏ་ཨ་དྷིཥྛི་ཏེ།
en: answered the Blessed One. “

source: ཧཱུྃ་ཧཱུྃ་སྭཱ་ཧཱ། ཨོཾ་སརྦ་ཏ་ཐཱ་ག་ཏ་ཨུཥྞཱི་ཥ་དྷཱ་ཏུ་མུ་དྲཱ་ཎི་སརྦ་ཏ་ཐཱ་ག་ཏ་དྷརྨ་དྷཱ་ཏུ་བི་བྷཱུ་ཥི་ཏ་ཨ་དྷིཥྛི་ཏེ་ཧུ་རུ་ཧུ་རུ། ཧཱུྃ་ཧཱུྃ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་ཀྱིས་རིང་བསྲེལ་གྱི་ཟ་མ་ཏོག་གི་ཕྱག་རྒྱའི་གཟུངས་འདི་བཤད་མ་ཐག་ཏུ་ཕྱོགས་བཅུ་དང་། ཕྱོགས་རེ་རེ་ཀུན་ནས་དེ་བཞིན་གཤེགས་པ་འབུམ་ཕྲག་བྱེ་བ་ཁྲག་ཁྲིག་ཏིལ་གྱི་གང་བུ་སྙེད་དགུ་བཅུ་རྩ་དགུ་གཤེགས་ནས།
en: This is the doctrinal synopsis of the dhāraṇī that is the seal of the receptacle of relics, for the thus-gone ones of the past, present, and future, for all the blessed buddhas who have attained complete nirvāṇa and the three bodies of the thus-gone one—the body of reality, the body of enjoyment, and the body of emanation—throughout all three times: “namastraiyadhvikānāṃ | sarvatathāgatānāṃ | oṁ bhu vibhavān vare vacaṭau | culu culu | dhara dhara | sarvatathāgatā | dhātudhare | padmagarbhe | jayavare | acale | smara tathāgata | dharmacakra | pravartana | vajrabodhimaṇḍa alaṃkāra | alaṃkṛte | sarvatathāgata | adhiṣṭhite | bodhaya bodhaya | bodhani bodhani | budhya buddhya | saṁbodhani saṁbodhaya | cala cala | calantu sarva āvaraṇāni | sarvapāpaṁ vigate | huru huru | sarvaśoka vigate | sarvatathāgatahṛdaya | vajriṇi | sambhava sambhava | sarvatathāgataguhye | dhāraṇimudre | buddhe | subuddhe | sarvatathāgata adhiṣṭhite | dhātugarbhe svāhā | samaya adhiṣṭhite svāhā | sarvatathāgatahṛdaya | dhātumudre svāhā | supratiṣṭhita stūpe tathāgata adhiṣṭhite | hūṁ hūṁ svāhā | oṁ sarvatathāgata uṣṇīṣadhātumudrāṇi sarvatathāgata dharmadhātu vibhūṣita adhiṣṭhite huru huru | hūṁ hūṁ svāhā” As soon as the Blessed One had uttered this dhāraṇī that is the seal of the receptacle of relics, from each of the ten directions came ninety-nine times the number of thus-gone ones who are as numerous as a hundred thousand times ten million times a hundred billion times the number of sesame seeds in a pod.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་ཤཱཀྱ་ཐུབ་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་འཛམ་བུའི་གླིང་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུའི་ཆོས་ཀྱི་གཏེར་བཞག་པ་དང་། རིང་བསྲེལ་གྱི་སྙིང་པོའི་མཆོད་རྟེན་བྱིན་གྱིས་བརླབས་པ་ལེགས་སོ།
en: They said to the Blessed One, the Sage of the Śākyas, “For the sake of sentient beings, the Sage of the Śākyas has placed this doctrinal synopsis, a treasure of the doctrine, in this world and has blessed this stūpa that is the quintessence of relics.

source: །ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ།
en: This is excellent, excellent!”

source: །འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དམ་ཚིག་དང་། བྱིན་གྱིས་བརླབས་པ་ཡིན་ནོ།
en: Thus was the pledge and blessing of all the thus-gone ones.

source: །གང་ན་རིང་བསྲེལ་གྱི་ཕྱག་རྒྱའི་གཟུངས་འདི་སྟོན་པར་བྱེད་དམ། མཆོད་རྟེན་གྱི་ནང་དུ་འཇོག་གམ། གཟུགས་བརྙན་གྱི་ནང་དུ་འཇོག་པར་བྱེད་པ་དེར། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱང་གཅིག་ཏུ་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་རྗེས་སུ་འབྲང་ཞིང་བཞུགས་པར་འགྱུར་རོ།
en: Wherever this dhāraṇī that is the seal of relics is taught, or wherever it is placed inside a stūpa or image, the thus-gone ones, all as one, will follow it continuously and remain there.

source: །ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: It will always be infused with the blessings of the thus-gone ones.

source: །དེ་ནས་གཟུངས་བཤད་པ་དང་། ཇི་ཙམ་ན་མཆོད་རྟེན་རྙིང་པ་ཕྱག་དར་གྱི་ཕུང་པོ་ལྟ་བུ་དེ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན་གྱི་མཆོད་རྟེན་དུ་མངོན་པར་འཕགས་ཤིང་འཕང་དང་། ལེགས་པར་རྣམ་པར་འབྱེས་པ་དང་། འཁོར་ལོའི་ཕྲེང་བ་དང་། བཀྲ་ཤིས་དང་བཅས་པར་གྱུར་ཏོ།
en: As soon as the dhāraṇī had been pronounced, the old stūpa that resembled a rubbish heap was restored as a stūpa having the nature of the seven precious materials, along with its moldings, symmetrical features, circular rings, and auspicious signs.

source: །བཅོམ་ལྡན་འདས་དགྱེས་ནས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: When the Blessed One had rejoiced and spoken thus, the great bodhisattva hero Vajrapāṇi, along with the world of gods and humans—the gods, nāgas, yakṣas, gandharvas, garuḍas, kinnaras, and mahoragas—rejoiced in and praised the words of the Blessed One.

source: མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དེ་དག་དང་། ལྷ་དང་། མིར་བཅས་པའི་འཇིག་རྟེན་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་ཡི་རངས་ཏེ་མངོན་པར་བསྟོད་དོ། །འཕགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱི་སྙིང་པོ་གསང་བའི་རིང་བསྲེལ་གྱི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་གཟུངས་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This completes the noble Mahāyāna sūtra, “The Dhāraṇī ‘The Receptacle of Secret Relics, Quintessence of the Blessings of All the Thus-Gone Ones.’”

source: པཎྜི་ཏ་བིདྱཱ་ཀ་ར་པྲ་བྷ་ཝ་དང་། ལོ་ཙྪ་བ་གཙང་དེ་ཝེནྡྲ་རཀྵིཏས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: Translated, edited, and redacted by the scholar Vidyākaraprabha and the translator Tsang Devendrarakṣita.
